Conf.Simple/src/InformationRegisters/SUI_ДополнительныеНастройкиТаблицИнтеграции/SUI_ДополнительныеНастройкиТаблицИнтеграции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>SUI_ДополнительныеНастройкиТаблицИнтеграции</name>
  <resources>
    <name>ДанныеНастройки</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <dimensions>
    <name>ТаблицаИнтеграции</name>
    <type>
      <types>EnumRef.SUI_ТаблицыИнтеграции</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Conf.Simple/src/Enums/SUI_ТаблицыИнтеграции/SUI_ТаблицыИнтеграции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>SUI_ТаблицыИнтеграции</name>
  <enumValues>
    <name>Контрагенты</name>
  </enumValues>
  <enumValues>
    <name>Склады</name>
  </enumValues>
  <enumValues>
    <name>Ячейки</name>
  </enumValues>
  <enumValues>
    <name>Номенклатура</name>
  </enumValues>
  <enumValues>
    <name>ХарактеристикиНоменклатуры</name>
  </enumValues>
  <enumValues>
    <name>СерииНоменклатуры</name>
  </enumValues>
  <enumValues>
    <name>ЕдиницыИзмерения</name>
  </enumValues>
  <enumValues>
    <name>УпаковкиНоменклатуры</name>
  </enumValues>
  <enumValues>
    <name>ВидыНоменклатуры</name>
  </enumValues>
  <enumValues>
    <name>ВидыЦен</name>
  </enumValues>
  <enumValues>
    <name>ЦеныНоменклатуры</name>
  </enumValues>
  <enumValues>
    <name>ШтрихкодыНоменклатуры</name>
  </enumValues>
  <enumValues>
    <name>ШтрихкодыУпаковок</name>
  </enumValues>
  <enumValues>
    <name>Документы</name>
  </enumValues>
  <enumValues>
    <name>ТоварыДокументов</name>
  </enumValues>
  <enumValues>
    <name>ШтрихкодыУпаковокДокументов</name>
  </enumValues>
  <enumValues>
    <name>ДокументыАдресногоХранения</name>
  </enumValues>
  <enumValues>
    <name>ТоварыДокументовАдресногоХранения</name>
  </enumValues>
  <enumValues>
    <name>НастройкиДокументов</name>
  </enumValues>
  <enumValues>
    <name>СерииДокументов</name>
  </enumValues>
  <enumValues>
    <name>ШаблоныЭтикеток</name>
  </enumValues>
  <enumValues>
    <name>ПользователиТСД</name>
  </enumValues>
</mdclass:Enum>

Conf.Simple/src/InformationRegisters/SUI_ДополнительныеНастройкиТаблицИнтеграции/Forms/ДополнительныеНастройки/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ТаблицаИнтеграции = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "ТаблицаИнтеграции");
	
	Если Не ЗначениеЗаполнено(ТаблицаИнтеграции) Тогда
		ОбщегоНазначения.СообщитьПользователю(
			НСтр("ru = 'Не удалось опредлелить таблицу дополнительных настроек'"), , , , Отказ);
		Возврат;
	КонецЕсли;
	
	Если ТекущийМодульМенеджер().ТаблицыИнтеграцииДополнительныхНастроек().Найти(ТаблицаИнтеграции) = Неопределено Тогда
		ОбщегоНазначения.СообщитьПользователю(СтрШаблон(
			НСтр("ru = 'Для таблицы ""%1"" не предусмотренны дополнительные настройки'"), ТаблицаИнтеграции), , , , Отказ);
		Возврат;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ИмяФормыНастройки = "";
	
	Если ТаблицаИнтеграции = ПредопределенноеЗначение("Перечисление.SUI_ТаблицыИнтеграции.СерииНоменклатуры") Тогда
		ИмяФормыНастройки = "РегистрСведений.SUI_ДополнительныеНастройкиТаблицИнтеграции.Форма.ДополнительныеНастройки_СерииНоменклатуры";
	ИначеЕсли ТаблицаИнтеграции = ПредопределенноеЗначение("Перечисление.SUI_ТаблицыИнтеграции.ШтрихкодыНоменклатуры") Тогда
		ИмяФормыНастройки = "РегистрСведений.SUI_ДополнительныеНастройкиТаблицИнтеграции.Форма.ДополнительныеНастройки_ШтрихкодыНоменклатуры";
	ИначеЕсли ТаблицаИнтеграции = ПредопределенноеЗначение("Перечисление.SUI_ТаблицыИнтеграции.ШтрихкодыУпаковок") Тогда
		ИмяФормыНастройки = "РегистрСведений.SUI_ДополнительныеНастройкиТаблицИнтеграции.Форма.ДополнительныеНастройки_ШтрихкодыУпаковок";
	КонецЕсли;
	
	Если Не ПустаяСтрока(ИмяФормыНастройки) Тогда
		ОповещениеОЗавершении = Новый ОписаниеОповещения("ПриЗакрытииФормыДополнительнойНастройки", ЭтотОбъект);
		ОткрытьФорму(ИмяФормыНастройки, , ЭтотОбъект, УникальныйИдентификатор, Окно, , ОповещениеОЗавершении);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ТекущийМодульМенеджер()
	Возврат РегистрыСведений.SUI_ДополнительныеНастройкиТаблицИнтеграции;
КонецФункции

&НаКлиенте
Процедура ПриЗакрытииФормыДополнительнойНастройки(Результат, ДополнительныеПараметры) Экспорт
	
	Если Открыта() Тогда
		Закрыть(НастройкиЗаписаны);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
